____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
unet_input (InputLayer)          (None, 1, 256, 256, 2 0
____________________________________________________________________________________________________
conv3d_1 (Conv3D)                (None, 32, 128, 128,  2080        unet_input[0][0]
____________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)        (None, 32, 128, 128,  0           conv3d_1[0][0]
____________________________________________________________________________________________________
conv3d_2 (Conv3D)                (None, 64, 64, 64, 64 131136      leaky_re_lu_1[0][0]
____________________________________________________________________________________________________
gen_en_bn_2 (BatchNormalization) (None, 64, 64, 64, 64 256         conv3d_2[0][0]
____________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)        (None, 64, 64, 64, 64 0           gen_en_bn_2[0][0]
____________________________________________________________________________________________________
conv3d_3 (Conv3D)                (None, 128, 32, 32, 3 524416      leaky_re_lu_2[0][0]
____________________________________________________________________________________________________
gen_en_bn_3 (BatchNormalization) (None, 128, 32, 32, 3 512         conv3d_3[0][0]
____________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)        (None, 128, 32, 32, 3 0           gen_en_bn_3[0][0]
____________________________________________________________________________________________________
conv3d_4 (Conv3D)                (None, 256, 16, 16, 1 2097408     leaky_re_lu_3[0][0]
____________________________________________________________________________________________________
gen_en_bn_4 (BatchNormalization) (None, 256, 16, 16, 1 1024        conv3d_4[0][0]
____________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)        (None, 256, 16, 16, 1 0           gen_en_bn_4[0][0]
____________________________________________________________________________________________________
conv3d_5 (Conv3D)                (None, 256, 8, 8, 8)  4194560     leaky_re_lu_4[0][0]
____________________________________________________________________________________________________
gen_en_bn_5 (BatchNormalization) (None, 256, 8, 8, 8)  1024        conv3d_5[0][0]
____________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)        (None, 256, 8, 8, 8)  0           gen_en_bn_5[0][0]
____________________________________________________________________________________________________
conv3d_6 (Conv3D)                (None, 256, 4, 4, 4)  4194560     leaky_re_lu_5[0][0]
____________________________________________________________________________________________________
gen_en_bn_6 (BatchNormalization) (None, 256, 4, 4, 4)  1024        conv3d_6[0][0]
____________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)        (None, 256, 4, 4, 4)  0           gen_en_bn_6[0][0]
____________________________________________________________________________________________________
conv3d_7 (Conv3D)                (None, 256, 2, 2, 2)  4194560     leaky_re_lu_6[0][0]
____________________________________________________________________________________________________
gen_en_bn_7 (BatchNormalization) (None, 256, 2, 2, 2)  1024        conv3d_7[0][0]
____________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)        (None, 256, 2, 2, 2)  0           gen_en_bn_7[0][0]
____________________________________________________________________________________________________
conv3d_8 (Conv3D)                (None, 256, 1, 1, 1)  4194560     leaky_re_lu_7[0][0]
____________________________________________________________________________________________________
gen_en_bn_8 (BatchNormalization) (None, 256, 1, 1, 1)  1024        conv3d_8[0][0]
____________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)        (None, 256, 1, 1, 1)  0           gen_en_bn_8[0][0]
____________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)   (None, 256, 2, 2, 2)  0           leaky_re_lu_8[0][0]
____________________________________________________________________________________________________
conv3d_9 (Conv3D)                (None, 256, 2, 2, 2)  4194560     up_sampling3d_1[0][0]
____________________________________________________________________________________________________
gen_de_bn_1 (BatchNormalization) (None, 256, 2, 2, 2)  1024        conv3d_9[0][0]
____________________________________________________________________________________________________
dropout_1 (Dropout)              (None, 256, 2, 2, 2)  0           gen_de_bn_1[0][0]
____________________________________________________________________________________________________
concatenate_1 (Concatenate)      (None, 512, 2, 2, 2)  0           dropout_1[0][0]
                                                                   leaky_re_lu_7[0][0]
____________________________________________________________________________________________________
activation_1 (Activation)        (None, 512, 2, 2, 2)  0           concatenate_1[0][0]
____________________________________________________________________________________________________
up_sampling3d_2 (UpSampling3D)   (None, 512, 4, 4, 4)  0           activation_1[0][0]
____________________________________________________________________________________________________
conv3d_10 (Conv3D)               (None, 512, 4, 4, 4)  16777728    up_sampling3d_2[0][0]
____________________________________________________________________________________________________
gen_de_bn_2 (BatchNormalization) (None, 512, 4, 4, 4)  2048        conv3d_10[0][0]
____________________________________________________________________________________________________
dropout_2 (Dropout)              (None, 512, 4, 4, 4)  0           gen_de_bn_2[0][0]
____________________________________________________________________________________________________
concatenate_2 (Concatenate)      (None, 768, 4, 4, 4)  0           dropout_2[0][0]
                                                                   leaky_re_lu_6[0][0]
____________________________________________________________________________________________________
activation_2 (Activation)        (None, 768, 4, 4, 4)  0           concatenate_2[0][0]
____________________________________________________________________________________________________
up_sampling3d_3 (UpSampling3D)   (None, 768, 8, 8, 8)  0           activation_2[0][0]
____________________________________________________________________________________________________
conv3d_11 (Conv3D)               (None, 512, 8, 8, 8)  25166336    up_sampling3d_3[0][0]
____________________________________________________________________________________________________
gen_de_bn_3 (BatchNormalization) (None, 512, 8, 8, 8)  2048        conv3d_11[0][0]
____________________________________________________________________________________________________
dropout_3 (Dropout)              (None, 512, 8, 8, 8)  0           gen_de_bn_3[0][0]
____________________________________________________________________________________________________
activation_3 (Activation)        (None, 512, 8, 8, 8)  0           dropout_3[0][0]
____________________________________________________________________________________________________
up_sampling3d_4 (UpSampling3D)   (None, 512, 16, 16, 1 0           activation_3[0][0]
____________________________________________________________________________________________________
conv3d_12 (Conv3D)               (None, 512, 16, 16, 1 16777728    up_sampling3d_4[0][0]
____________________________________________________________________________________________________
gen_de_bn_4 (BatchNormalization) (None, 512, 16, 16, 1 2048        conv3d_12[0][0]
____________________________________________________________________________________________________
dropout_4 (Dropout)              (None, 512, 16, 16, 1 0           gen_de_bn_4[0][0]
____________________________________________________________________________________________________
concatenate_4 (Concatenate)      (None, 768, 16, 16, 1 0           dropout_4[0][0]
                                                                   leaky_re_lu_4[0][0]
____________________________________________________________________________________________________
activation_4 (Activation)        (None, 768, 16, 16, 1 0           concatenate_4[0][0]
____________________________________________________________________________________________________
up_sampling3d_5 (UpSampling3D)   (None, 768, 32, 32, 3 0           activation_4[0][0]
____________________________________________________________________________________________________
conv3d_13 (Conv3D)               (None, 512, 32, 32, 3 25166336    up_sampling3d_5[0][0]
____________________________________________________________________________________________________
gen_de_bn_5 (BatchNormalization) (None, 512, 32, 32, 3 2048        conv3d_13[0][0]
____________________________________________________________________________________________________
dropout_5 (Dropout)              (None, 512, 32, 32, 3 0           gen_de_bn_5[0][0]
____________________________________________________________________________________________________
concatenate_5 (Concatenate)      (None, 640, 32, 32, 3 0           dropout_5[0][0]
                                                                   leaky_re_lu_3[0][0]
____________________________________________________________________________________________________
activation_5 (Activation)        (None, 640, 32, 32, 3 0           concatenate_5[0][0]
____________________________________________________________________________________________________
up_sampling3d_6 (UpSampling3D)   (None, 640, 64, 64, 6 0           activation_5[0][0]
____________________________________________________________________________________________________
conv3d_14 (Conv3D)               (None, 256, 64, 64, 6 10486016    up_sampling3d_6[0][0]
____________________________________________________________________________________________________
gen_de_bn_6 (BatchNormalization) (None, 256, 64, 64, 6 1024        conv3d_14[0][0]
____________________________________________________________________________________________________
dropout_6 (Dropout)              (None, 256, 64, 64, 6 0           gen_de_bn_6[0][0]
____________________________________________________________________________________________________
concatenate_6 (Concatenate)      (None, 320, 64, 64, 6 0           dropout_6[0][0]
                                                                   leaky_re_lu_2[0][0]
____________________________________________________________________________________________________
activation_6 (Activation)        (None, 320, 64, 64, 6 0           concatenate_6[0][0]
____________________________________________________________________________________________________
up_sampling3d_7 (UpSampling3D)   (None, 320, 128, 128, 0           activation_6[0][0]
____________________________________________________________________________________________________
conv3d_15 (Conv3D)               (None, 128, 128, 128, 2621568     up_sampling3d_7[0][0]
____________________________________________________________________________________________________
gen_de_bn_7 (BatchNormalization) (None, 128, 128, 128, 512         conv3d_15[0][0]
____________________________________________________________________________________________________
dropout_7 (Dropout)              (None, 128, 128, 128, 0           gen_de_bn_7[0][0]
____________________________________________________________________________________________________
concatenate_7 (Concatenate)      (None, 160, 128, 128, 0           dropout_7[0][0]
                                                                   leaky_re_lu_1[0][0]
____________________________________________________________________________________________________
activation_7 (Activation)        (None, 160, 128, 128, 0           concatenate_7[0][0]
____________________________________________________________________________________________________
up_sampling3d_8 (UpSampling3D)   (None, 160, 256, 256, 0           activation_7[0][0]
____________________________________________________________________________________________________
conv3d_16 (Conv3D)               (None, 1, 256, 256, 2 10241       up_sampling3d_8[0][0]
____________________________________________________________________________________________________
activation_8 (Activation)        (None, 1, 256, 256, 2 0           conv3d_16[0][0]
====================================================================================================
Total params: 120,750,433
Trainable params: 120,742,113
Non-trainable params: 8,320
____________________________________________________________________________________________________
/local_raid/data/brainhack/code/DCGAN-keras/networks/discriminator.py:109: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(500, activation=None, use_bias=False)`
  M = Dense(num_kernels * dim_per_kernel, bias=False, activation=None)
____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
patch_gan_input_0 (InputLayer)   (None, 1, 256, 256, 2 0
____________________________________________________________________________________________________
patch_gan (Model)                [(None, 2), (None, 25 19539682    patch_gan_input_0[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 500)           128000      patch_gan[2][1]
____________________________________________________________________________________________________
reshape_1 (Reshape)              (None, 100, 5)        0           dense_1[0][0]
____________________________________________________________________________________________________
lambda_1 (Lambda)                (None, 100)           0           reshape_1[0][0]
____________________________________________________________________________________________________
concatenate_8 (Concatenate)      (None, 102)           0           patch_gan[2][0]
                                                                   lambda_1[0][0]
____________________________________________________________________________________________________
disc_output (Dense)              (None, 2)             206         concatenate_8[0][0]
====================================================================================================
Total params: 19,667,888
Trainable params: 19,664,944
Non-trainable params: 2,944
____________________________________________________________________________________________________
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
DCGAN_input (InputLayer)     (None, 1, 256, 256, 256)  0
_________________________________________________________________
unet_generator (Model)       (None, 1, 256, 256, 256)  120750433
_________________________________________________________________
lambda_2 (Lambda)            (None, 1, 256, 256, 256)  0
_________________________________________________________________
discriminator_nn (Model)     (None, 2)                 19667888
=================================================================
Total params: 140,418,321
Trainable params: 120,742,113
Non-trainable params: 19,676,208
_________________________________________________________________
